# -*- coding: UTF-8 -*-
asctodv = {
	  "1":"१", "2":"२", "3":"३", "4":"४", "5":"५", "6":"६", "7":"७", "8":"८", "9":"९", "0":"०", "q":"क़", "w":"व", "e":"ऐ", "r":"र", "t":"त", "y":"य","aa":"अ", "u":"उ", "i":"इ", "o":"ओ", "p":"प", "a":"अ", "aa":"आ","s":"स", "d":"द", "f":"फ", "g":"ग", "h":"ह", "j":"ज", "k":"क", "l":"ल", "z":"ज", "x":"क्स", "c":"स", "v":"व", "b":"ब", "n":"न", "m":"म", "bh":"भ", "ch":"च", "dh":"ध", "gh":"घ", "jh":"झ", "kh":"ख", "ph":"फ", "sh":"श", "th":"थ", "zh":"झ", "dny":"ज्ञ", "ksh":"क्ष", "delhi":"दिल्ली", "bro":"ब्र", "the":"द", "stio":"श", "mee":"मी", "manmohan": "मनमोहन", 'strie':'स्ट्रि'}

asctomatra = {
	  "a":"", "aa":"ा", "i":"ि", "ee":"ी", "ii":"ी", "e":"े", "ai":"ै", "o":"ो", "au":"ौ", "u":"ु", "uu":"ू"}

phoneme = {
	"AA":"ऑ", "AE":"ॲ",  "AO":"औ", "AW":"ाऊ", "AY":"ाई", "B":"ब", "CH":"च", "D":"ड", "DH":"थ", "EH":"ए", "ER":"र", "EY":"ए", "F":"फ", "G":"ग", "HH":"ह", "IH":"इ", "IY":"ई", "JH":"ज", "K":"क", "L":"ल", "M":"म", "N":"न", "NG":"न्ग", "OW":"ओ", "OY":"ॉई", "P":"प", "R":"र", "S":"स", "SH":"श", "T":"ट", "TH":"थ", "V":"व", "W":"व", "Y":"य", "Z":"झ", "ZH":"ज़", "AH":"अ"
#, need to handle differently
}

phoneme_matra = {
	"AA":"ॉ", "AE":"ॅ",  "AO":"ौ", "EY":"े", "IH":"ि", "IY":"ी", "OW":"ो", "EH":"े","AH":"", "UH":"ू", "UW":"ु", "AY":"ाई"
}

cmu_vow = ['AA', 'AE', 'AH', 'AO','EY','IH', 'IY','OW','EH', 'UH', 'UW' , 'AY']
cmu_cons = [ 'B', 'CH', 'D', 'DH', 'ER',  'F', 'G', 'HH',  'JH', 'K', 'L', 'M', 'N', 'NG',  'OY', 'P', 'R', 'S', 'SH', 'T', 'TH', 'V ', 'W', 'Y', 'Z', 'ZH']

